app/views/carcategories/show.html.erb

<h3>Modelos de carro</h3>
<% @carcategory.car_models.each do |car_model| %>
---
SELECT "car_models".* FROM "car_models" WHERE "car_models"."carcategory_id" = ?  [["carcategory_id", 1]]