app/controllers/car_models_controller.rb

	def index
		@car_models = CarModel.all
		if CarModel.count == 0
---
SELECT "car_models".* FROM "car_models"
SELECT COUNT(*) FROM "car_models"

	def show
		@car_model = CarModel.find(params[:id])
---
SELECT "car_models".* FROM "car_models" WHERE "car_models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def new
		@car_model= CarModel.new
		@manufacturers = Manufacturer.all
		@carcategories = Carcategory.all
---
SELECT "manufacturers".* FROM "manufacturers"
SELECT "carcategories".* FROM "carcategories"

	def create
		@car_model = CarModel.new(car_model_params)
		if @car_model.save
			redirect_to @car_model
		else
			@manufacturers = Manufacturer.all
			@carcategories = Carcategory.all
---
INSERT INTO "car_models" ("name", "year", "manufacturer_id", "created_at", "updated_at", "motorization", "fuel_type", "carcategory_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT "manufacturers".* FROM "manufacturers"
SELECT "carcategories".* FROM "carcategories"