app/controllers/carcategories_controller.rb

SELECT "carcategories".* FROM "carcategories"
SELECT COUNT(*) FROM "carcategories"
---
  def index
    @carcategories = Carcategory.all
    if Carcategory.count == 0

INSERT INTO "carcategories" ("name", "daily_rate", "car_insurance", "third_party_insurance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Van"], ["daily_rate", 400.0], ["car_insurance", 500.0], ["third_party_insurance", 1000.0], ["created_at", "2020-04-19 03:04:09.228623"], ["updated_at", "2020-04-19 03:04:09.228623"]]
---
  def create
    @carcategory = Carcategory.new(carcategory_params)
    @carcategory.save

SELECT "carcategories".* FROM "carcategories" WHERE "carcategories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @carcategory = Carcategory.find(params[:id])

SELECT "carcategories".* FROM "carcategories" WHERE "carcategories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @carcategory = Carcategory.find(params[:id])

SELECT "carcategories".* FROM "carcategories" WHERE "carcategories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "carcategories" SET "name" = ?, "daily_rate" = ?, "car_insurance" = ?, "third_part_insurance" = ?, "updated_at" = ? WHERE "carcategories"."id" = ?  [["name", "A"], ["daily_rate", 100.0], ["car_insurance", 50.0], ["third_part_insurance", 100.0], ["updated_at", "2020-05-01 04:54:08.117255"], ["id", 1]]
---
  def update
    @carcategory = Carcategory.find(params[:id])
    if @carcategory.update(carcategory_params)