app/controllers/cars_controller.rb

  def index
    @cars = Car.all
    if Car.count== 0
---
SELECT "cars".* FROM "cars"
SELECT COUNT(*) FROM "cars"

  def new
    @car = Car.new
    @subsidiaries = Subsidiary.all
    @car_models = CarModel.all
---
SELECT "subsidiaries".* FROM "subsidiaries"
SELECT "car_models".* FROM "car_models"

  def create
    @car = Car.create(car_params)
    if @car.save
      flash[:notice] = 'Carro criado com sucesso'
      redirect_to cars_path
    else
      @subsidiaries = Subsidiary.all
      @car_models = CarModel.all
---
SELECT "subsidiaries".* FROM "subsidiaries"
SELECT "car_models".* FROM "car_models"