app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
SELECT COUNT(*) FROM "customers"
---
  def index
    @customers = Customer.all
    if Customer.count == 0

INSERT INTO "customers" ("name", "document", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Alexandre"], ["document", "132.306.272-61"], ["email", "alexandre@gmail.com"], ["created_at", "2020-04-29 05:04:53.990323"], ["updated_at", "2020-04-29 05:04:53.990323"]]
---
  def create
    @customer = Customer.new(customer_params)
    if @customer.save