app/controllers/manufacturers_controller.rb

SELECT "manufacturers".* FROM "manufacturers"
SELECT COUNT(*) FROM "manufacturers"
---
  def index
    @manufacturers = Manufacturer.all
    if Manufacturer.count == 0

INSERT INTO "manufacturers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "SIM"], ["created_at", "2020-04-24 04:21:27.424164"], ["updated_at", "2020-04-24 04:21:27.424164"]]
---
  def create
    @manufacturer = Manufacturer.new(manufacturer_params)
    if @manufacturer.save

SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @manufacturer = Manufacturer.find(params[:id])

SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "manufacturers" SET "name" = ?, "updated_at" = ? WHERE "manufacturers"."id" = ?  [["name", "Volkswagena"], ["updated_at", "2020-04-22 03:38:03.687503"], ["id", 2]]
---
  def update
    @manufacturer = Manufacturer.find(params[:id])
    if @manufacturer.update(manufacturer_params)

SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "manufacturers" WHERE "manufacturers"."id" = ?  [["id", 5]]
---
  def destroy
    @manufacturer = Manufacturer.find(params[:id])
    @manufacturer.destroy

SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    @manufacturer = Manufacturer.find(params[:id])