app/controllers/manufacturers_controller.rb

  def show
    id = params[:id]
    @manufacturer = Manufacturer.find(id)
---
SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]