app/controllers/rentals_controller.rb

SELECT "rentals".* FROM "rentals"
SELECT COUNT(*) FROM "rentals"
---
  def index
    @rentals = Rental.all
    if Rental.count == 0

SELECT "customers".* FROM "customers"
SELECT "carcategories".* FROM "carcategories"
---
  def new
    @rental = Rental.new
    @customers = Customer.all
    @car_categories = Carcategory.all

SELECT "customers".* FROM "customers"
SELECT "carcategories".* FROM "carcategories"
---
  def create
    @rental = Rental.create(rental_params)
    if @rental.save!
      flash[:notice] = 'Locação criada com sucesso'
      redirect_to rentals_path
    else
      @customers = Customer.all
      @car_categories = Carcategory.all