app/controllers/subsidiaries_controller.rb

    def index
      @subsidiaries = Subsidiary.all
      if Subsidiary.count == 0
---
SELECT "subsidiaries".* FROM "subsidiaries"
SELECT COUNT(*) FROM "subsidiaries"

    def create
      @subsidiary = Subsidiary.new(subsidiary_params)
      @subsidiary.save
---
INSERT INTO "subsidiaries" ("name", "cnpj", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Sunolandia"], ["cnpj", "9999"], ["address", "Rua do suno, 789"], ["created_at", "2020-04-19 02:49:52.751397"], ["updated_at", "2020-04-19 02:49:52.751397"]]

    def show
      id = params[:id]
      @subsidiary = Subsidiary.find(id)
---
SELECT "subsidiaries".* FROM "subsidiaries" WHERE "subsidiaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
      @subsidiary = Subsidiary.find(params[:id])
---
SELECT "subsidiaries".* FROM "subsidiaries" WHERE "subsidiaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
      @subsidiary= Subsidiary.find(params[:id])
      if @subsidiary.update(subsidiary_params)
---
SELECT "subsidiaries".* FROM "subsidiaries" WHERE "subsidiaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "subsidiaries" SET "cnpj" = ?, "updated_at" = ? WHERE "subsidiaries"."id" = ?  [["cnpj", "74.534.339/0001-04"], ["updated_at", "2020-04-27 02:35:01.076886"], ["id", 1]]