app/views/car_models/new.html.erb

SELECT "carcategories".* FROM "carcategories"
---
  <%= f.label :carcategory_id, 'Categoria de Carro' %>
  <%= f.collection_select :carcategory_id, Carcategory.all, :id, :name%>